Revit 2015 API
InSessionPrintSetting Class
Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class InSessionPrintSetting : IPrintSetting
Visual Basic
Public Class InSessionPrintSetting _
	Implements IPrintSetting
Visual C++
public ref class InSessionPrintSetting : IPrintSetting
Remarks
The in-session PrintSetting can't be stored in document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.InSessionPrintSetting
See Also
InSessionPrintSetting Members
Autodesk.Revit.DB Namespace